Documents/абс_ЗаявкаНаТранспорт/абс_ЗаявкаНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗаявкаНаТранспорт</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактыОтветственногоМенеджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.абс_Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.абс_Города</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставкиКонтрагента</name>
    <type>
      <types>CatalogRef.абс_СпособыДоставкиКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоМоноПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТКНазначения</name>
    <comment>Транспортная компания назначения</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПромежуточный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоМиксПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <types>CatalogRef.Номенклатура</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипДома</name>
    <type>
      <types>EnumRef.ТипыДомов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКорпуса</name>
    <type>
      <types>EnumRef.ТипыКорпусов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКвартиры</name>
    <type>
      <types>EnumRef.ТипыКвартир</types>
    </type>
  </resources>
  <resources>
    <name>абс_ФайлДопДанных</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ТипАдреса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ЛичныеКонтакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ДатаАктуальностиКИ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/абс_СтатусыЗаявокНаТранспорт/абс_СтатусыЗаявокНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СтатусыЗаявокНаТранспорт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаявкаНаТранспорт</name>
    <type>
      <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/абс_СтатусыОтгрузки/абс_СтатусыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыОтгрузки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Подобран</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаСборка</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_СтатусыЗаявокНаТранспорт/абс_СтатусыЗаявокНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыЗаявокНаТранспорт</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>КИсполнению</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Catalogs/абс_СпособыДоставкиКонтрагентов/абс_СпособыДоставкиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_СпособыДоставкиКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.абс_ВидыСпособовДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеДоставки</name>
    <type>
      <types>EnumRef.абс_УсловияДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТК1</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТК2</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТК3</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТК1_Статус</name>
    <type>
      <types>EnumRef.Лео_СтатусДоверенностиНаТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ТК2_Статус</name>
    <type>
      <types>EnumRef.Лео_СтатусДоверенностиНаТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ТК3_Статус</name>
    <type>
      <types>EnumRef.Лео_СтатусДоверенностиНаТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ТК1_ДатаДействияДоверенности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТК2_ДатаДействияДоверенности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТК3_ДатаДействияДоверенности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Documents/абс_ЗаявкаНаТранспорт/ObjectModule.bsl
Процедура РассчитатьКоличествоМест(СтрокаТЧ)
	
	Если СтрокаТЧ.ЕдиницаИзмеренияМест.Коэффициент = 0 Тогда
		СтрокаТЧ.КоличествоМест = 0;
	Иначе
		СтрокаТЧ.КоличествоМест = СтрокаТЧ.Количество * СтрокаТЧ.ЕдиницаИзмерения.Коэффициент / СтрокаТЧ.ЕдиницаИзмеренияМест.Коэффициент;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	//найдем уже существующий документ, введенный на основании заказа
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Грузополучатель,
		|	ЗаказПокупателя.Дата,
		|	ЗаказПокупателя.Организация,
		|	ЗаказПокупателя.Грузополучатель.Регион КАК БизнесРегион,
		|	ЗаказПокупателя.СкладГруппа,
		|	ЗаказПокупателя.Подразделение,
		|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК АдресКонтрагента,
		|	ЗаказПокупателя.Грузополучатель.абс_ОсновнойСпособДоставки КАК СпособДоставки,
		|	ЕСТЬNULL(ЗаказПокупателя.Грузополучатель.абс_ОсновнойСпособДоставки.АдресДоставки, """") КАК АдресДоставки,
		|	ЗаказПокупателя.Ссылка,
		|	ЗаказПокупателя.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ЕСТЬNULL(ЗаказПокупателя.Грузополучатель.Регион.абс_Регион, ЗНАЧЕНИЕ(Справочник.абс_Регионы.ПустаяСсылка)) КАК Регион,
		|	ЕСТЬNULL(ЗаказПокупателя.Грузополучатель.Регион.абс_Город, ЗНАЧЕНИЕ(Справочник.абс_Города.ПустаяСсылка)) КАК Город,
		|	ЕСТЬNULL(ЗаказПокупателя.Грузополучатель.абс_ОсновнойСпособДоставки.ТК2, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ТКНазначения,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателя.абс_СпособДоставкиКонтрагента = ЗНАЧЕНИЕ(Справочник.абс_СпособыДоставкиКонтрагентов.ПустаяСсылка)
		|			ТОГДА ЗаказПокупателя.Грузополучатель.абс_ОсновнойСпособДоставки
		|		ИНАЧЕ ЗаказПокупателя.абс_СпособДоставкиКонтрагента
		|	КОНЕЦ КАК СпособДоставкиКонтрагента,
		|	ЕСТЬNULL(ЗаказПокупателя.Грузополучатель.ОсновнойМенеджерПокупателя.ФизЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ОтветственныйМенеджер,
		|	ЗаказПокупателя.Контрагент
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО ЗаказПокупателя.Контрагент = КонтактнаяИнформация.Объект
		|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
		|ГДЕ
		|	ЗаказПокупателя.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка",ДанныеЗаполнения);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Дата						= Выборка.ДатаОтгрузки;
			Организация					= Выборка.Организация;	
			
			Если ЗначениеЗаполнено(Выборка.Грузополучатель) Тогда
				Контрагент				= Выборка.Грузополучатель;
			Иначе
				Контрагент				= Выборка.Контрагент;
			КонецЕсли;
			
			ОтветственныйМенеджер		= Выборка.ОтветственныйМенеджер;
			БизнесРегион    			= Выборка.БизнесРегион;
			Регион						= Выборка.Регион;
			Город						= Выборка.Город;
			ДокументОтгрузки			= ДанныеЗаполнения;
			Если ТипЗнч(Выборка.СкладГруппа)=Тип("СправочникСсылка.Склады") Тогда
				Склад           		= Выборка.СкладГруппа;
			КонецЕсли;
			Подразделение   			= Выборка.Подразделение;
			Если ДанныеЗаполнения.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Отгружен ИЛИ ДанныеЗаполнения.абс_Статус = Перечисления.абс_СтатусыОтгрузки.Закрыт Тогда
				Статус        			= Перечисления.абс_СтатусыЗаявокНаТранспорт.КИсполнению;
			Иначе
				Статус        			= Перечисления.абс_СтатусыЗаявокНаТранспорт.КИсполнению;
			КонецЕсли;
			ЗаказПокупателя 			= Выборка.Ссылка;
			ПланируемаяДатаОтгрузки 	= Выборка.ДатаОтгрузки;
			ПланируемаяДатаДоставки 	= Выборка.ДатаОтгрузки;
			//АдресКонтрагента			= абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Контрагент);
			АдресКонтрагента			= Выборка.АдресКонтрагента; //zhiga
			ТКНазначения				= Выборка.ТКНазначения;
			СпособДоставкиКонтрагента 	= Выборка.СпособДоставкиКонтрагента;
			// {Катанович
			//АдресПромежуточный			= абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Выборка.ТКНазначения);
			Если ЗначениеЗаполнено(ТКНазначения) Тогда
				АдресПромежуточный			= абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Выборка.ТКНазначения);
			Иначе
				АдресПромежуточный = СпособДоставкиКонтрагента.АдресДоставки;
			КонецЕсли;
			// 20.20.2020 по заявке Щербининой А.А. 
			//АдресКонтрагента			= ?(ЗначениеЗаполнено(СпособДоставкиКонтрагента),СпособДоставкиКонтрагента.АдресДоставки, "");

			// Катанович}
			
			// zhiga {
			// Убоженко, водители путают адрес доставки и везут на адрес Контрагента
			ОсновнойСпособДоставки = Контрагент.абс_ОсновнойСпособДоставки;
			Если ЗначениеЗаполнено(ОсновнойСпособДоставки) тогда
			АдресКонтрагента = ?(ЗначениеЗаполнено(ОсновнойСпособДоставки.АдресДоставки),ОсновнойСпособДоставки.АдресДоставки,АдресКонтрагента);
			КонецЕсли;
			// zhiga }
			
			
		КонецЦикла;
		
		Товары.Очистить();
		
		Для Каждого СтрокаТаб ИЗ ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = СтрокаТаб.Номенклатура;
			НоваяСтрока.Количество     			= СтрокаТаб.Количество;
			НоваяСтрока.ЕдиницаИзмерения 		= СтрокаТаб.ЕдиницаИзмерения;  			
			НоваяСтрока.Сумма            		= ?(ДанныеЗаполнения.СуммаВключаетНДС, СтрокаТаб.Сумма, СтрокаТаб.Сумма+СтрокаТаб.СуммаНДС);
			НоваяСтрока.ЕдиницаИзмеренияМест 	= СтрокаТаб.ЕдиницаИзмеренияМест;
			РассчитатьКоличествоМест(НоваяСтрока);
			// {Лео Катанович
			//БЫЛО
			//НоваяСтрока.Объем            	= СтрокаТаб.ЕдиницаИзмеренияМест.Объем * СтрокаТаб.КоличествоМест;
			//НоваяСтрока.ВесБрутто       	= СтрокаТаб.ЕдиницаИзмеренияМест.Вес * СтрокаТаб.КоличествоМест;
			Если СтрокаТаб.КоличествоМест  > 0 ТОГДА
				НоваяСтрока.Объем            	= СтрокаТаб.ЕдиницаИзмеренияМест.Объем * СтрокаТаб.КоличествоМест;
				НоваяСтрока.ВесБрутто       	= СтрокаТаб.ЕдиницаИзмеренияМест.Вес * СтрокаТаб.КоличествоМест;
			Иначе 	 
				НоваяСтрока.Объем       		= СтрокаТаб.ЕдиницаИзмерения.Объем * СтрокаТаб.Количество;
				НоваяСтрока.ВесБрутто       	= СтрокаТаб.ЕдиницаИзмерения.Вес * СтрокаТаб.Количество;
			КонецЕсли;	 
			
			// Лео Катанович}
		КонецЦикла;
		
		ОбновитьИтоговыеРеквизиты();
		
		абс_Дистрибуция.ЗаполнитьДокументОтгрузкиВЗаявкеНаТранспорт(ЭтотОбъект,ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.СкладПолучатель.абс_Контрагент КАК Контрагент,
		|	ПеремещениеТоваров.Дата,
		|	ПеремещениеТоваров.Организация,
		|	ПеремещениеТоваров.СкладПолучатель.абс_Контрагент.Регион КАК БизнесРегион,
		|	ПеремещениеТоваров.СкладОтправитель КАК СкладГруппа,
		|	ПеремещениеТоваров.Подразделение,
		|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК АдресКонтрагента,
		|	ПеремещениеТоваров.СкладПолучатель.абс_Контрагент.абс_ОсновнойСпособДоставки КАК СпособДоставки,
		|	ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.абс_Контрагент.абс_ОсновнойСпособДоставки.АдресДоставки, """") КАК АдресДоставки,
		|	ПеремещениеТоваров.Ссылка,
		|	ПеремещениеТоваров.Дата КАК ДатаОтгрузки,
		|	ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.абс_Контрагент.Регион.абс_Регион, ЗНАЧЕНИЕ(Справочник.абс_Регионы.ПустаяСсылка)) КАК Регион,
		|	ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.абс_Контрагент.Регион.абс_Город, ЗНАЧЕНИЕ(Справочник.абс_Города.ПустаяСсылка)) КАК Город,
		|	ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.абс_Контрагент.абс_ОсновнойСпособДоставки.ТК2, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ТКНазначения,
		|	ПеремещениеТоваров.СкладПолучатель.абс_Контрагент.абс_ОсновнойСпособДоставки КАК СпособДоставкиКонтрагента,
		|	ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.абс_Контрагент.ОсновнойМенеджерПокупателя.ФизЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ОтветственныйМенеджер
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО ПеремещениеТоваров.СкладПолучатель.абс_Контрагент = КонтактнаяИнформация.Объект
		|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
		|ГДЕ
		|	ПеремещениеТоваров.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Дата						= Выборка.ДатаОтгрузки;
			Организация					= Выборка.Организация;	
			Контрагент					= Выборка.Контрагент;
			ОтветственныйМенеджер		= Выборка.ОтветственныйМенеджер;
			БизнесРегион    			= Выборка.БизнесРегион;
			Регион						= Выборка.Регион;
			Город						= Выборка.Город;
			ДокументОснование			= ДанныеЗаполнения;
			Если ТипЗнч(Выборка.СкладГруппа)=Тип("СправочникСсылка.Склады") Тогда
				Склад           		= Выборка.СкладГруппа;
			КонецЕсли;
			Подразделение   			= Выборка.Подразделение;
			Статус        				= Перечисления.абс_СтатусыЗаявокНаТранспорт.КИсполнению;
			ЗаказПокупателя 			= Выборка.Ссылка;
			ПланируемаяДатаОтгрузки 	= Выборка.ДатаОтгрузки;
			ПланируемаяДатаДоставки 	= Выборка.ДатаОтгрузки;
			АдресКонтрагента			= абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Выборка.Контрагент);
			АдресПромежуточный			= абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Выборка.ТКНазначения);
			ТКНазначения				= Выборка.ТКНазначения;
			СпособДоставкиКонтрагента 	= Выборка.СпособДоставкиКонтрагента;
		КонецЦикла;
		
		Товары.Очистить();
		
		Для Каждого СтрокаТаб ИЗ ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура 			= СтрокаТаб.Номенклатура;
			НоваяСтрока.Количество     			= СтрокаТаб.Количество;
			НоваяСтрока.ЕдиницаИзмерения 		= СтрокаТаб.ЕдиницаИзмерения;  			
			НоваяСтрока.Сумма            		= СтрокаТаб.Количество * СтрокаТаб.Цена;
			НоваяСтрока.ЕдиницаИзмеренияМест 	= СтрокаТаб.ЕдиницаИзмеренияМест;
			РассчитатьКоличествоМест(НоваяСтрока);
			НоваяСтрока.Объем            		= СтрокаТаб.ЕдиницаИзмеренияМест.Объем * СтрокаТаб.КоличествоМест;
			НоваяСтрока.ВесБрутто       		= СтрокаТаб.ЕдиницаИзмеренияМест.Вес * СтрокаТаб.КоличествоМест;
		КонецЦикла;
		
		ОбновитьИтоговыеРеквизиты();	
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст=
		"ВЫБРАТЬ
		|	ЗаказПоставщику.Контрагент КАК Контрагент,
		|	ЗаказПоставщику.Дата,
		|	ЗаказПоставщику.Организация,
		|	ЗаказПоставщику.Контрагент.Регион КАК БизнесРегион,
		|	ЗаказПоставщику.Склад,
		|	ЗаказПоставщику.Подразделение,
		|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК АдресКонтрагента,
		|	ЗаказПоставщику.Контрагент.абс_ОсновнойСпособДоставки КАК СпособДоставки,
		|	ЕСТЬNULL(ЗаказПоставщику.Контрагент.абс_ОсновнойСпособДоставки.АдресДоставки, """") КАК АдресДоставки,
		|	ЗаказПоставщику.Ссылка,
		|	ЗаказПоставщику.ДатаПоступления КАК ДатаОтгрузки,
		|	ЕСТЬNULL(ЗаказПоставщику.Контрагент.Регион.абс_Регион, ЗНАЧЕНИЕ(Справочник.абс_Регионы.ПустаяСсылка)) КАК Регион,
		|	ЕСТЬNULL(ЗаказПоставщику.Контрагент.Регион.абс_Город, ЗНАЧЕНИЕ(Справочник.абс_Города.ПустаяСсылка)) КАК Город,
		|	ЕСТЬNULL(ЗаказПоставщику.Контрагент.абс_ОсновнойСпособДоставки.ТК2, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК ТКНазначения,
		|	ЗаказПоставщику.Контрагент.абс_ОсновнойСпособДоставки КАК СпособДоставкиКонтрагента,
		|	ЕСТЬNULL(ЗаказПоставщику.Контрагент.ОсновнойМенеджерПокупателя.ФизЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ОтветственныйМенеджер
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО ЗаказПоставщику.Контрагент = КонтактнаяИнформация.Объект
		|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
		|ГДЕ
		|	ЗаказПоставщику.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка",ДанныеЗаполнения);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Дата						= Выборка.ДатаОтгрузки;
			Организация					= Выборка.Организация;	
			Контрагент				    = Выборка.Контрагент;
            Склад           		    = Выборка.Склад;			
			ОтветственныйМенеджер		= Выборка.ОтветственныйМенеджер;
			БизнесРегион    			= Выборка.БизнесРегион;
			Регион						= Выборка.Регион;
			Город						= Выборка.Город;
			ДокументОснование			= ДанныеЗаполнения;
			Склад           		    = Выборка.Склад;
			Подразделение   			= Выборка.Подразделение;
			Статус        			    = Перечисления.абс_СтатусыЗаявокНаТранспорт.КИсполнению;
		
			ПланируемаяДатаОтгрузки 	= Выборка.ДатаОтгрузки;
			ПланируемаяДатаДоставки 	= Выборка.ДатаОтгрузки;
			
			//АдресКонтрагента			= абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Контрагент);
			АдресКонтрагента			= Выборка.АдресКонтрагента;
			ТКНазначения				= Выборка.ТКНазначения;
			СпособДоставкиКонтрагента 	= Выборка.СпособДоставкиКонтрагента;
			
			Если ЗначениеЗаполнено(ТКНазначения) Тогда
				АдресПромежуточный			= абс_ТранспортнаяЛогистика.ПолучитьОсновнойАдресКонтрагента(Выборка.ТКНазначения);
			Иначе
				АдресПромежуточный = СпособДоставкиКонтрагента.АдресДоставки;
			КонецЕсли;
			
		КонецЦикла;
		
		Товары.Очистить();
		
		Для Каждого СтрокаТаб ИЗ ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = СтрокаТаб.Номенклатура;
			НоваяСтрока.Количество     			= СтрокаТаб.Количество;
			НоваяСтрока.ЕдиницаИзмерения 		= СтрокаТаб.ЕдиницаИзмерения;  			
			НоваяСтрока.Сумма            		= ?(ДанныеЗаполнения.СуммаВключаетНДС, СтрокаТаб.Сумма, СтрокаТаб.Сумма+СтрокаТаб.СуммаНДС);
			НоваяСтрока.ЕдиницаИзмеренияМест 	= СтрокаТаб.ЕдиницаИзмеренияМест;
			РассчитатьКоличествоМест(НоваяСтрока);
			Если СтрокаТаб.КоличествоМест  > 0 ТОГДА
				НоваяСтрока.Объем            	= СтрокаТаб.ЕдиницаИзмеренияМест.Объем * СтрокаТаб.КоличествоМест;
				НоваяСтрока.ВесБрутто       	= СтрокаТаб.ЕдиницаИзмеренияМест.Вес * СтрокаТаб.КоличествоМест;
			Иначе 	 
				НоваяСтрока.Объем       		= СтрокаТаб.ЕдиницаИзмерения.Объем * СтрокаТаб.Количество;
				НоваяСтрока.ВесБрутто       	= СтрокаТаб.ЕдиницаИзмерения.Вес * СтрокаТаб.Количество;
			КонецЕсли;	 
		КонецЦикла;
		
		ОбновитьИтоговыеРеквизиты();
		
	КонецЕсли;
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() Тогда
		
		Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
			
			ЗаявкаНаТранспорт = абс_Дистрибуция.НайтиЗаявкуПоЗаказуПокупателя(ЗаказПокупателя, Ссылка);
			
			Если ЗначениеЗаполнено(ЗаявкаНаТранспорт) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("На основании заказа покупателя '" + Строка(ЗаказПокупателя)  + "' уже введен документ '" + ЗаявкаНаТранспорт + "'", Отказ);
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(ДокументОснование) Тогда
			
			ЗаявкаНаТранспорт = абс_Дистрибуция.НайтиЗаявкуПоПеремещению(ДокументОснование, Ссылка);
			
			Если ЗначениеЗаполнено(ЗаявкаНаТранспорт) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("На основании перемещения товаров '" + Строка(ДокументОснование)  + "' уже введен документ '" + ЗаявкаНаТранспорт + "'", Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьИтоговыеРеквизиты();
	
КонецПроцедуры

Процедура ОбновитьИтоговыеРеквизиты()
	
	ВсегоОбъем             = Товары.Итог("Объем");
	ВсегоВес               = Товары.Итог("ВесБрутто");
	СуммаДокумента         = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//сохраняем историю изменений статусов документа
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	абс_СтатусыЗаявокНаТранспортСрезПоследних.Статус
	|ИЗ
	|	РегистрСведений.абс_СтатусыЗаявокНаТранспорт.СрезПоследних(, ЗаявкаНаТранспорт = &ЗаявкаНаТранспорт) КАК абс_СтатусыЗаявокНаТранспортСрезПоследних
	|";
	
	Запрос.УстановитьПараметр("ЗаявкаНаТранспорт", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать(); //запрос возвращает не более одной записи
	Если Выборка.Следующий() Тогда
		Если Выборка.Статус <> Статус Тогда
			ДобавитьЗапись = Истина;
		Иначе
			ДобавитьЗапись = Ложь;
		КонецЕсли;
	Иначе
		ДобавитьЗапись = Истина;
	КонецЕсли;
	
	Если ДобавитьЗапись Тогда
		ЗаписьРегистра = РегистрыСведений.абс_СтатусыЗаявокНаТранспорт.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Период = ТекущаяДата();
		ЗаписьРегистра.ЗаявкаНаТранспорт = Ссылка;
		ЗаписьРегистра.Статус = Статус;
		ЗаписьРегистра.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ЗаписьРегистра.Записать();
	КонецЕсли;
	
КонецПроцедуры
